hiradict = {
    'symbols':
        ['あ', 'い', 'う', 'え', 'お',
        'か', 'き', 'く', 'け', 'こ',
        'が', 'ぎ', 'ぐ', 'げ', 'ご',
        'さ', 'し', 'す', 'せ', 'そ',
        'ざ', 'じ', 'ず', 'ぜ', 'ぞ',
        'た', 'ち', 'つ', 'て', 'と',
        'だ', 'ぢ', 'づ', 'で', 'ど',
        'な', 'に', 'ぬ', 'ね', 'の',
        'は', 'ひ', 'ふ', 'へ', 'ほ',
        'ば', 'び', 'ぶ', 'べ', 'ぼ',
        'ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ',
        'ま', 'み', 'む', 'め', 'も',
        'や', 'ゆ', 'よ',
        'ら', 'り', 'る', 'れ', 'ろ',
        'わ', 'を', 'ん']
    ,
    'sounds':
        ['a', 'i', 'u', 'e', 'o',
        'ka', 'ki', 'ku', 'ke', 'ko',
        'ga', 'gi', 'gu', 'ge', 'go',
        'sa', 'shi', 'su', 'se', 'so',
        'za', 'ji', 'zu', 'ze', 'zo',
        'ta', 'chi', 'tsu', 'te', 'to',
        'da', 'ji', 'zu', 'de', 'do',
        'na', 'ni', 'nu', 'ne', 'no',
        'ha', 'hi', 'fu', 'he', 'ho',
        'ba', 'bi', 'bu', 'be', 'bo',
        'pa', 'pi', 'pu', 'pe', 'po',
        'ma', 'mi', 'mu', 'me', 'mo',
        'ya', 'yu', 'yo',
        'ra', 'ri', 'ru', 're', 'ro',
        'wa', 'wo', 'n']
}

hiracombosdict = {
    'symbols':
        ['きゃ', 'きゅ', 'きょ',
        'ぎゃ', 'ぎゅ', 'ぎょ',
        'しゃ', 'しゅ', 'しょ',
        'じゃ', 'じゅ', 'じょ',
        'ちゃ', 'ちゅ', 'ちょ',
        'にゃ', 'にゅ', 'にょ',
        'ひゃ', 'ひゅ', 'ひょ',
        'びゃ', 'びゅ', 'びょ',
        'ぴゃ', 'ぴゅ', 'ぴょ',
        'みゃ', 'みゅ', 'みょ',
        'りゃ', 'りゅ', 'りょ']
    ,
    'sounds':
        ['kya', 'kyu', 'kyo',
        'gya', 'gyu', 'gyo',
        'sha', 'shu', 'sho',
        'ja', 'ju', 'jo',
        'cha', 'chu', 'cho',
        'nya', 'nyu', 'nyo',
        'hya', 'hyu', 'hyo',
        'bya', 'byu', 'byo',
        'pya', 'pyu', 'pyo',
        'mya', 'myu', 'myo',
        'rya', 'ryu', 'ryo']
}
