katadict = {
    'symbols':
        ['ア', 'イ', 'ウ', 'エ', 'オ',
        'カ', 'キ', 'ク', 'ケ', 'コ',
        'ガ', 'ギ', 'グ', 'ゲ', 'ゴ',
        'サ', 'シ', 'ス', 'セ', 'ソ',
        'ザ', 'ジ', 'ズ', 'ゼ', 'ゾ',
        'タ', 'チ', 'ツ', 'テ', 'ト',
        'ダ', 'ヂ', 'ヅ', 'デ', 'ド',
        'ナ', 'ニ', 'ヌ', 'ネ', 'ノ',
        'ハ', 'ヒ', 'フ', 'ヘ', 'ホ',
        'バ', 'ビ', 'ブ', 'ベ', 'ボ',
        'パ', 'ピ', 'プ', 'ペ', 'ポ',
        'マ', 'ミ', 'ム', 'メ', 'モ',
        'ヤ', 'ユ', 'ヨ',
        'ラ', 'リ', 'ル', 'レ', 'ロ',
        'ワ', 'ヲ', 'ン']
    ,
    'sounds':
        ['a', 'i', 'u', 'e', 'o',
        'ka', 'ki', 'ku', 'ke', 'ko',
        'ga', 'gi', 'gu', 'ge', 'go',
        'sa', 'shi', 'su', 'se', 'so',
        'za', 'ji', 'zu', 'ze', 'zo',
        'ta', 'chi', 'tsu', 'te', 'to',
        'da', 'ji', 'zu', 'de', 'do',
        'na', 'ni', 'nu', 'ne', 'no',
        'ha', 'hi', 'fu', 'he', 'ho',
        'ba', 'bi', 'bu', 'be', 'bo',
        'pa', 'pi', 'pu', 'pe', 'po',
        'ma', 'mi', 'mu', 'me', 'mo',
        'ya', 'yu', 'yo',
        'ra', 'ri', 'ru', 're', 'ro',
        'wa', 'wo', 'n']
}

katacombosdict = {
    'symbols':
        ['キャ', 'キュ', 'キョ',
        'ギャ', 'ギュ', 'ギョ',
        'シャ', 'シュ', 'ショ',
        'ジャ', 'ジュ', 'ジョ',
        'チャ', 'チュ', 'チョ',
        'ニャ', 'ニュ', 'ニョ',
        'ヒャ', 'ヒュ', 'ヒョ',
        'ビャ', 'ビュ', 'ビョ',
        'ピャ', 'ピュ', 'ピョ',
        'ミャ', 'ミュ', 'ミョ',
        'リャ', 'リュ', 'リョ']
    ,
    'sounds':
        ['kya', 'kyu', 'kyo',
        'gya', 'gyu', 'gyo',
        'sha', 'shu', 'sho',
        'ja', 'ju', 'jo',
        'cha', 'chu', 'cho',
        'nya', 'nyu', 'nyo',
        'hya', 'hyu', 'hyo',
        'bya', 'byu', 'byo',
        'pya', 'pyu', 'pyo',
        'mya', 'myu', 'myo',
        'rya', 'ryu', 'ryo']
}